In [3]:
import pandas as pd
import numpy as np

## Question 1

Suppose we have the following DataFrame about pandas (the animal) shown below. We will calculate various statistics about pandas using the pandas library. In the end, we will hopefully understand pandas and pandas better!
The DataFrame `panda` contains two columns: age and height for 10,000 pandas acr ss the world.

In [4]:
panda = pd.DataFrame(
    {
        "name" : ['Pete', 'Sarah', 'Bono', 'Jasper', 'May'],
        "age": [13, 17, 9, 2, 4],
        "height": [18, 29, 7, 4, 13]
    }
)
panda

     name  age  height
0    Pete   13      18
1   Sarah   17      29
2    Bono    9       7
3  Jasper    2       4
4     May    4      13

### Part a

Let us first convert the pandas heights into values with meters. Create a column
`height in meters` that has each panda’s height in meters instead, and add it to the
Dataframe `panda`.

In [5]:
panda['height_in_meters'] = panda['height']/100
panda

     name  age  height  height_in_meters
0    Pete   13      18              0.18
1   Sarah   17      29              0.29
2    Bono    9       7              0.07
3  Jasper    2       4              0.04
4     May    4      13              0.13

### Part b

We first want to know if there is a relationship between a panda’s age and height in
meters. Write a one-line expression to calculate the average ratio between a panda’s
height and age for all pandas in our DataFrame.

In [6]:
(panda['height_in_meters']/panda['age']).mean()

0.018236551030668676

### Part c

Instead, suppose we decide to calculate the median height for each age. Write a
one-line pandas expression to accomplish this.

In [7]:
panda.groupby("age")["height"].median()

age
2      4
4     13
9      7
13    18
17    29
Name: height, dtype: int64

### Part d

Expanding on the expression from the previous section, calculate the median ratio
between a panda’s height and age for each age. Write pandas code to accomplish
this.

In [8]:
panda['height/age'] = panda['height'] / panda['age']
panda.groupby("age")['height/age'].agg('median')

age
2     2.000000
4     3.250000
9     0.777778
13    1.384615
17    1.705882
Name: height/age, dtype: float64

### Part e

The zoo manager sends you another Dataframe mothers of mother-children relationships for the pandas in the above Dataframe:

In [9]:
mother = pd.DataFrame(
    data = {
        'child' : ['Jasper', 'May', 'Sarah', 'Pete', 'Bono'],
        'mother' : ['Giselle', 'Alice', 'May', 'Alex', 'Bella']
    }
)
mother

    child   mother
0  Jasper  Giselle
1     May    Alice
2   Sarah      May
3    Pete     Alex
4    Bono    Bella

Write a line of pandas code to add a new column mother to the DataFrame panda
that contains each panda’s corresponding mother.

In [10]:
panda.merge(mother, left_on = 'name', right_on = 'child').drop(columns="child")

     name  age  height  height_in_meters  height/age   mother
0    Pete   13      18              0.18    1.384615     Alex
1   Sarah   17      29              0.29    1.705882      May
2    Bono    9       7              0.07    0.777778    Bella
3  Jasper    2       4              0.04    2.000000  Giselle
4     May    4      13              0.13    3.250000    Alice

## Question 2

We will work with an Olympics dataset containing the names of all athletes who par-
ticipated in the Olympic Games, including all the Games from Athens 1896 to Tokyo
2020. We refer to this dataframe as ath. The first 5 lines of the table are shown below.
You may assume that the ID column is unique to each athlete and that the only column
with null values are height, weight, and medal.

In [12]:
ath = pd.DataFrame({"ID": [1, 2, 2, 3, 4],
             "Name": ["Edgar Lindenau Aabye", "Minna Maarit Aalto", "Minna Maarit Aalto", "Kjetil Andr Aamodt", "Ragnhild Margrethe Aamodt"],
             "Sex": ["M", "F", "F", "M", "F"],
             "Age": [34.0, 30.0, 34.0, 20.0, 27.0],
             "Height": [np.nan, 159, 159, 176, 163],
             "Weight": [np.nan, 55.5, 55.5, 85, np.nan],
             "Team": ["Denmark/Sweden", "Finland", "Finland", "Norway", "Norway"],
             "Year": [1900, 1996, 2000, 1992, 2008],
             "Season": ['Summer', "Summer", "Summer", "Winter", "Summer"],
             "City": ["Paris", "Atlanta", "Sydney", "Albertville", "Beijing"],
             "Sport": ["Tug-Of-War", "Sailing", "Sailing", "Alpine Skiing", "Handball"],
             "Event": ["Tug-Of-War Men's Tug-Of-War", "Sailing Women's Windsurfer", "Sailing Women's Windsurfer", "Alpine Skiing Men's Super G", "Handball Women's Handball"],
             "Medal": ["Gold", np.nan, np.nan, "Gold", "Gold"]})


ath

,ID,Name,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
0,1,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
1,2,Minna Maarit Aalto,F,30.0,159.0,55.5,Finland,1996,Summer,Atlanta,Sailing,Sailing Women's Windsurfer,NaN
2,2,Minna Maarit Aalto,F,34.0,159.0,55.5,Finland,2000,Summer,Sydney,Sailing,Sailing Women's Windsurfer,NaN
3,3,Kjetil Andr Aamodt,M,20.0,176.0,85.0,Norway,1992,Winter,Albertville,Alpine Skiing,Alpine Skiing Men's Super G,Gold
4,4,Ragnhild Margrethe Aamodt,F,27.0,163.0,NaN,Norway,2008,Summer,Beijing,Handball,Handball Women's Handball,Gold

### Part a

Write pandas code to returns the 10 most common middle names among gold medal
winners as pandas Series. The column Name contains the first name, the middle
name, and the last name of each athlete that are separated by space. You may
assume that all athletes in the table have a middle name. You can assume all
athlete’s names are unique.

In [13]:
ath.loc[ath["Medal"] == "Gold", "Name"].str.split().str[1].value_counts().index[:10]

Index(['Andr', 'Lindenau', 'Margrethe'], dtype='object')

### Part b

Which of the following lines of Pandas code will output the the most number of
medals won by a single athlete?

In [14]:
# Choice (A)
ath['ID'].groupby('ID').count().iloc[0]

KeyError: 'ID'

In [15]:
# Choice (B)
ath[['ID']].groupby('ID').count().iloc[0]

Series([], Name: 1, dtype: float64)

In [16]:
# Choice (C)
ath[["ID", "Medal", "Name"]].groupby("Name").count().sort_values("Medal", ascending = False)["Medal"].iloc[0]

## can't do value_counts() because it'll find the total count of non-null and null medals. 
## .count() just finds the count of non-null

1

In [17]:
# Choice (D)
ath[['ID', 'Medal']].groupby('ID').size().iloc[0]

1

In [18]:
# Choice (E)
ath[['Name', 'Medal']].groupby('Name').sum().iloc[0]

Medal    Gold
Name: Edgar Lindenau Aabye, dtype: object

In [19]:
# Choice (F)
ath[['Name', 'Medal']].groupby('Name').count().iloc[0].sort\_values(
'Medal', ascending = False)

SyntaxError: unexpected character after line continuation character (<ipython-input-19-af8738ac2721>, line 2)

### Part c

What are the oldest athletes to participate in each sport along with the corre-
sponding year in which they participated? For this question, the ’corresponding
year’ referred to the final year that the athlete participated.

In [20]:
ath.sort_values('Age', ascending=False)

,ID,Name,Sex,Age,Height,Weight,Team,Year,Season,City,Sport,Event,Medal
0,1,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
2,2,Minna Maarit Aalto,F,34.0,159.0,55.5,Finland,2000,Summer,Sydney,Sailing,Sailing Women's Windsurfer,NaN
1,2,Minna Maarit Aalto,F,30.0,159.0,55.5,Finland,1996,Summer,Atlanta,Sailing,Sailing Women's Windsurfer,NaN
4,4,Ragnhild Margrethe Aamodt,F,27.0,163.0,NaN,Norway,2008,Summer,Beijing,Handball,Handball Women's Handball,Gold
3,3,Kjetil Andr Aamodt,M,20.0,176.0,85.0,Norway,1992,Winter,Albertville,Alpine Skiing,Alpine Skiing Men's Super G,Gold

In [21]:
ath.sort_values('Age', ascending=False).groupby('Sport').agg({'Name':'first', 'Year':'first'})

                                    Name  Year
Sport
Alpine Skiing         Kjetil Andr Aamodt  1992
Handball       Ragnhild Margrethe Aamodt  2008
Sailing               Minna Maarit Aalto  2000
Tug-Of-War          Edgar Lindenau Aabye  1900

### Part d

Fill in the blanks below to return the names of all the athletes who won a medal
after a gap of 10 years or more of not winning any Olympics medals. You may
assume that each individual’s name is unique to them.

##### Currently no output because the dataset isn't comprehensive, but feel free to play around with the DataFrame to generate output

In [22]:
def filter_func(subframe):
    return (subframe["Year"].diff() >= 10).any()

# note that pd.diff is not required!
# return (subframe[’Year’].iloc[:-1].values + 10 <=
# subframe[’Year’].iloc[1:].values).any()

ath.sort_values("Year")[~ath["Medal"].isna()].groupby("Name").filter(filter_func)["Name"].unique()

<ipython-input-22-bc50b746e4c9>:8: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  ath.sort_values("Year")[~ath["Medal"].isna()].groupby("Name").filter(filter_func)["Name"].unique()

array([], dtype=object)

### Part e

Write a line of pandas code that creates from `ath` a table with rows for teams,
columns for sports, and the average age of female athletes for each row-column
combination as each cell’s values.

In [24]:
ath[ath['Sex'] == 'F'].pivot_table(values='Age', index='Team', columns='Sport', aggfunc=np.mean)

Sport    Handball  Sailing
Team
Finland       NaN     32.0
Norway       27.0      NaN